handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_comp.c
/**
*     Copyright (c) 2023, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g05x_comp.c
*\*\author Nations 
*\*\version v1.0.0
*\*\copyright Copyright (c) 2023, Nations Technologies Inc. All rights reserved.
**/
 
#include "n32g05x_comp.h"
#include "n32g05x_rcc.h"

#define COMP_FILTCR_MASK        ((uint32_t)0x000007FFU)
/**
*\*\name    COMP_Reset.
*\*\fun     Reset the COMP registers.
*\*\return  none
**/
void COMP_DeInit(void)
{
    RCC_EnableAPB1PeriphReset(RCC_APB1_PERIPH_COMP);
}

/**
*\*\name    COMP_Init.
*\*\fun     Initializes the COMP peripheral according to the specified parameters in the COMP_InitStruct
*\*\param   COMP_initstruct :
*\*\param   Blking :
*\*\          - COMP_CTRL_BLKING_NO
*\*\          - COMP_CTRL_BLKING_TIM1_OC5
*\*\param   Hyst :
*\*\          - COMP_CTRL_HYST_NO   
*\*\          - COMP_CTRL_HYST_LOW  
*\*\          - COMP_CTRL_HYST_MID     
*\*\          - COMP_CTRL_HYST_HIGH 
*\*\param   PolRev :
*\*\          - COMP_OUTPOL_REV   
*\*\          - COMP_OUTPOL_NREV
*\*\param   InpSel :
*\*\          - COMP1
*\*\            - COMP1_CTRL_INPSEL_PA2                   
*\*\            - COMP1_CTRL_INPSEL_PA3                   
*\*\            - COMP1_CTRL_INPSEL_VREF_VC1                   
*\*\            - COMP1_CTRL_INPSEL_PB1                  
*\*\          - COMP2
*\*\            - COMP2_CTRL_INPSEL_PB1                   
*\*\            - COMP2_CTRL_INPSEL_PA6                   
*\*\            - COMP2_CTRL_INPSEL_PB10                   
*\*\            - COMP2_CTRL_INPSEL_PA5                                     
*\*\            - COMP2_CTRL_INPSEL_VREF_VC2                   
*\*\          - COMP3
*\*\            - COMP3_CTRL_INPSEL_PA10                   
*\*\            - COMP3_CTRL_INPSEL_DAC_OUT_PB13                   
*\*\            - COMP3_CTRL_INPSEL_VREF_VC1                   
*\*\            - COMP3_CTRL_INPSEL_PD7                 
*\*\          - COMP4
*\*\            - COMP4_CTRL_INPSEL_PD7                   
*\*\            - COMP4_CTRL_INPSEL_PA12                   
*\*\            - COMP4_CTRL_INPSEL_PD5                   
*\*\            - COMP4_CTRL_INPSEL_VREF_VC2  
*\*\param   InmSel :
*\*\          - COMP1
*\*\            - COMP1_CTRL_INMSEL_PA5                   
*\*\            - COMP1_CTRL_INMSEL_PB0         
*\*\            - COMP1_CTRL_INMSEL_PA2                   
*\*\            - COMP1_CTRL_INMSEL_VREF_VC1                    
*\*\            - COMP1_CTRL_INMSEL_DAC_OUT_PB13                  
*\*\          - COMP2
*\*\            - COMP2_CTRL_INMSEL_PA3     
*\*\            - COMP2_CTRL_INMSEL_PB2      
*\*\            - COMP2_CTRL_INMSEL_PA4                   
*\*\            - COMP2_CTRL_INMSEL_DAC_OUT_PB13      
*\*\          - COMP3
*\*\            - COMP3_CTRL_INMSEL_PA9     
*\*\            - COMP3_CTRL_INMSEL_PD6      
*\*\            - COMP3_CTRL_INMSEL_VREF_VC1                   
*\*\            - COMP3_CTRL_INMSEL_DAC_OUT_PB13    
*\*\          - COMP4
*\*\            - COMP4_CTRL_INMSEL_PA11     
*\*\            - COMP4_CTRL_INMSEL_PD4      
*\*\            - COMP4_CTRL_INMSEL_VREF_VC2                   
*\*\            - COMP4_CTRL_INMSEL_DAC_OUT_PB13
*\*\param   OutSel :
*\*\          - COMP1
*\*\            - COMP1_CTRL_OUTSEL_T1_OCREFCLEAR
*\*\            - COMP1_CTRL_OUTSEL_T1_BKIN                
*\*\            - COMP1_CTRL_OUTSEL_T1_IC1  
*\*\            - COMP1_CTRL_OUTSEL_T2_IC1        
*\*\            - COMP1_CTRL_OUTSEL_T2_IC4              
*\*\            - COMP1_CTRL_OUTSEL_T2_OCREFCLEAR                                 
*\*\            - COMP1_CTRL_OUTSEL_T3_IC1  
*\*\            - COMP1_CTRL_OUTSEL_T3_IC4  
*\*\            - COMP1_CTRL_OUTSEL_T3_OCREFCLEAR  
*\*\            - COMP1_CTRL_OUTSEL_T4_IC1  
*\*\            - COMP1_CTRL_OUTSEL_T4_IC4  
*\*\            - COMP1_CTRL_OUTSEL_T4_OCREFCLEAR  
*\*\            - COMP1_CTRL_OUTSEL_T5_IC1  
*\*\            - COMP1_CTRL_OUTSEL_T5_IC4  
*\*\            - COMP1_CTRL_OUTSEL_T5_OCREFCLEAR  
*\*\          - COMP2
*\*\            - COMP2_CTRL_OUTSEL_T1_OCREFCLEAR
*\*\            - COMP2_CTRL_OUTSEL_T1_BKIN                
*\*\            - COMP2_CTRL_OUTSEL_T1_IC1  
*\*\            - COMP2_CTRL_OUTSEL_T2_IC1        
*\*\            - COMP2_CTRL_OUTSEL_T2_IC2             
*\*\            - COMP2_CTRL_OUTSEL_T2_OCREFCLEAR                                 
*\*\            - COMP2_CTRL_OUTSEL_T3_IC1  
*\*\            - COMP2_CTRL_OUTSEL_T3_IC2  
*\*\            - COMP2_CTRL_OUTSEL_T3_OCREFCLEAR  
*\*\            - COMP2_CTRL_OUTSEL_T4_IC1  
*\*\            - COMP2_CTRL_OUTSEL_T4_IC2  
*\*\            - COMP2_CTRL_OUTSEL_T4_OCREFCLEAR  
*\*\            - COMP2_CTRL_OUTSEL_T5_IC1  
*\*\            - COMP2_CTRL_OUTSEL_T5_IC2  
*\*\            - COMP2_CTRL_OUTSEL_T5_OCREFCLEAR  
*\*\          - COMP3
*\*\            - COMP3_CTRL_OUTSEL_T1_OCREFCLEAR
*\*\            - COMP3_CTRL_OUTSEL_T1_BKIN                
*\*\            - COMP3_CTRL_OUTSEL_T1_IC1  
*\*\            - COMP3_CTRL_OUTSEL_T2_IC1        
*\*\            - COMP3_CTRL_OUTSEL_T2_IC2             
*\*\            - COMP3_CTRL_OUTSEL_T2_OCREFCLEAR                                 
*\*\            - COMP3_CTRL_OUTSEL_T3_IC1  
*\*\            - COMP3_CTRL_OUTSEL_T3_IC2  
*\*\            - COMP3_CTRL_OUTSEL_T3_OCREFCLEAR  
*\*\            - COMP3_CTRL_OUTSEL_T4_IC1  
*\*\            - COMP3_CTRL_OUTSEL_T4_IC2  
*\*\            - COMP3_CTRL_OUTSEL_T4_OCREFCLEAR  
*\*\            - COMP3_CTRL_OUTSEL_T5_IC1  
*\*\            - COMP3_CTRL_OUTSEL_T5_IC2  
*\*\            - COMP3_CTRL_OUTSEL_T5_OCREFCLEAR  
*\*\          - COMP4
*\*\            - COMP4_CTRL_OUTSEL_T1_OCREFCLEAR
*\*\            - COMP4_CTRL_OUTSEL_T1_BKIN                
*\*\            - COMP4_CTRL_OUTSEL_T1_IC1  
*\*\            - COMP4_CTRL_OUTSEL_T2_IC3        
*\*\            - COMP4_CTRL_OUTSEL_T2_IC4              
*\*\            - COMP4_CTRL_OUTSEL_T2_OCREFCLEAR                                 
*\*\            - COMP4_CTRL_OUTSEL_T3_IC3  
*\*\            - COMP4_CTRL_OUTSEL_T3_IC4  
*\*\            - COMP4_CTRL_OUTSEL_T3_OCREFCLEAR  
*\*\            - COMP4_CTRL_OUTSEL_T4_IC3  
*\*\            - COMP4_CTRL_OUTSEL_T4_IC4  
*\*\            - COMP4_CTRL_OUTSEL_T4_OCREFCLEAR  
*\*\            - COMP4_CTRL_OUTSEL_T5_IC3  
*\*\            - COMP4_CTRL_OUTSEL_T5_IC4  
*\*\            - COMP4_CTRL_OUTSEL_T5_OCREFCLEAR  
*\*\param   ClkPsc:
*\*\          Value can be set from 0 to 65535.
*\*\param   FilterEn:
*\*\          - ENABLE 
*\*\          - DISABLE
*\*\param   Threshold:
*\*\          - this value must be greater than SAMPW / 2 .
*\*\param   SampWindow:
*\*\          - from 0 to 31.
*\*\param   En
*\*\          - ENABLE
*\*\          - DISABLE
*\*\return  none
**/
void COMP_Init(COMPX COMPx, COMP_InitType* COMP_InitStruct)
{
    COMP_SingleType *pCS ;
    __IO uint32_t tmpreg1 = 0;
    if(COMPx == COMP1)
    {
        pCS = (COMP_SingleType*)&COMP->COMP1;
    }
    else if(COMPx == COMP2)
    {
        pCS = (COMP_SingleType*)&COMP->COMP2;
    }
    else if(COMPx == COMP3)
    {
        pCS = (COMP_SingleType*)&COMP->COMP3;
    }
    else if(COMPx == COMP4)
    {
        pCS = (COMP_SingleType*)&COMP->COMP4;
    }
    else
    {
        pCS = NULL;
    }

    if(pCS == NULL)
    {
        return ;
    }

